---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.NumberSystemDisplayRule
source: html/fd8df892-efc9-0148-190d-6783bcac25ff.htm
---
# Autodesk.Revit.DB.ParameterTypeId.NumberSystemDisplayRule Property

"Display Rule"

## Syntax (C#)
```csharp
public static ForgeTypeId NumberSystemDisplayRule { get; }
```